# -----------------------------------------------------------------------------------------------------#
# --------------Использование циклов внутри циклов, возврат значений,  условия-------------------------#
# -----------------------------------------------------------------------------------------------------#
print("Регистрация персонажа")
gender = ""
race = ""
role = ""
name = ""

reg = 0
while reg < 1:
    reg_gender = 0
    while reg_gender < 1:
        gender = input("Выберете пол персонажа\n1-муж\n2-жен\n: ")
        if gender == "1":
            gender = "Мужской"
            reg_gender += 1
            print(f"Выбран {gender} пол")
        elif gender == "2":
            gender = "Женский"
            reg_gender += 1
            print(f"Выбран {gender} пол")
        else:
            print("Выберете пол из перечисленного!")
        if reg_gender == 1:
            reg_race = 0
            while reg_race < 1:
                race = input("Выберете рассу персонажа\n1-Человек\n2-Эльф\n0-вернуться\n: ")
                if race == "1":
                    race = "Человек"
                    reg_race += 1
                    print(f"Выбран {race}")
                elif race == "2":
                    race = "Эльф"
                    reg_race += 1
                    print(f"Выбран {race}")
                elif race == "0":
                    reg_gender = 0
                    break
                else:
                    print("Выберете рассу из перечисленного!")

                if reg_race == 1:
                    reg_role = 0
                    if race == "Человек":
                        print("Выберете класс:\n", "1-Воин", "2-Лучник", "3-Жрец", "4-Маг")
                        while reg_role < 1:
                            role = input("введите 1,2,3 или 4 для выбора класса, 0-вернуться\n: ")
                            reg_role += 1
                            if role == "1":
                                role = "Воин"
                            elif role == "2":
                                role = "Лучник"
                            elif role == "3":
                                role = "Жрец"
                            elif role == "4":
                                role = "Маг"
                            elif role == "0":
                                reg_race = 0
                                reg_role = 0
                                break
                            else:
                                print("Выберете класс человека из перечисленного!")
                                reg_role = 0

                    elif race == "Эльф":
                        print("Выберете класс:\n", "1-Воин\n", "2-Лучник\n", "3-Темный Колдун\n",
                              "4-Паладин\n")
                        while reg_role < 1:
                            role = input("введите 1,2,3 или 4 для выбора класса, 0-вернуться\n: ")
                            reg_role += 1
                            if role == "1":
                                role = "Воин"
                            elif role == "2":
                                role = "Лучник"
                            elif role == "3":
                                role = "Темный Колдун"
                            elif role == "4":
                                role = "Паладин"
                            elif role == "0":
                                reg_race = 0
                                reg_role = 0
                                break
                            else:
                                print("Выберете класс эльфа из перечисленного!")
                                reg_role = 0

    name = str(input("Введите имя вашего персонажа "))

    # переменные типа reg_x... говорят о совершенном выборе, и значит надо было бы использовать их
    # для определения заполненности полей, но данный цикл не позволяет оставлять пустые поля, и является лишь одним
    # из путей их заполнения. по этому для проверки будут использоваться сами поля
    # * Для имитации пустого поля все же можно использовать name
    if len(gender) != 0 and len(race) != 0 and len(role) != 0 and len(name) != 0:
        print("\nИнформация о персонаже:\n"
              f"пол персонажа {gender}\n"
              f"Раса персонажа {race}\n"
              f"Класс: {role}\n"
              f"Имя: {name}\n")
        reg += 1
    else:
        reg = 0
